import os
from google import genai
from dotenv import load_dotenv

from utils import prompt
# load the env file
load_dotenv()

client = genai.Client(api_key=os.getenv("GEMINI_KEY"))

example_text = "FDA ออกคำแนะนำระเบียบควบคุมเชิงป้องกันอาหารสัตว์ของ FSMA 11 กรกฎาคม 2565 องค์การอาหารและยาแห่งสหรัฐอเมริกา FDA ได้สรุปแนวทางปฏิบัติสำหรับภาคอุตสาหกรรมเกี่ยวกับการวิเคราะห์อันตรายและการควบคุมเชิงป้องกันความเสี่ยงสำหรับอาหารสัตว์ เพื่อช่วยให้โรงงานผลิตอาหารสัตว์พัฒนาแผนความปลอดภัยด้านอาหารเพื่อป้องกันและลดอันตรายที่อาจก่อให้เกิดการเจ็บป่วยหรือบาดเจ็บให้เหลือน้อยที่สุดอย่างมีนัยสำคัญสำหรับคนและสัตว์เอกสารนี้ให้คำแนะนำที่สำคัญเกี่ยวกับ วิธีการรับรู้และประเมินผลทางชีวภาพ เคมี รวมถึงรังสี และทางกายภาพที่ทราบหรืออันตรายที่คาดการณ์ได้อย่างเหมาะสมในการผลิต การแปรรูป การบรรจุ และการกักเก็บอาหารสัตว์ วิธีการระบุและดำเนินการควบคุมเชิงป้องกันสำหรับอันตรายที่จำเป็นต้องมีการควบคุมการป้องกันในอาหารสัตว์ องค์ประกอบของการจัดการควบคุมการป้องกัน เช่น การเฝ้าติดตาม การดำเนินการแก้ไข และการทวนสอบ รวมถึงการตรวจสอบความถูกต้อง และ ข้อกำหนดในการเก็บบันทึกที่เกี่ยวข้องกับแผนความปลอดภัยด้านอาหารและการดำเนินการตามแผนความปลอดภัยด้านอาหาร การเปลี่ยนแปลงที่โดดเด่นที่สุดประการหนึ่งคือการตอบสนองต่อข้อเสนอแนะของผู้มีส่วนได้ส่วนเสีย FDA ได้นำภาคผนวกออก ความช่วยเหลือในการระบุอันตรายของอาหารสัตว์ และชี้แจงว่าตัวอย่างความเป็นอันตรายบางตัวอย่างในคำแนะนำไม่สามารถใช้ได้กับอาหารสัตว์ทั้งหมดหรือสิ่งอำนวยความสะดวกทั้งหมด สถานประกอบการควรใช้ข้อมูลความเป็นอันตรายในคู่มือนี้เพื่อพิจารณาว่าอาหารสัตว์มีอันตรายเฉพาะที่ทราบหรือคาดการณ์ได้อย่างสมเหตุสมผลหรือไม่ องค์การอาหารและยายังได้เพิ่มข้อมูล ทรัพยากร และตัวอย่างเพิ่มเติมเกี่ยวกับอันตรายบางอย่างในอาหารสัตว์ รวมถึงข้อมูลเกี่ยวกับการเรียกคืนอาหารสัตว์ที่เกิดขึ้นตั้งแต่ร่างคำแนะนำที่เผยแพร่ สุดท้ายนี้ FDA ได้ทำการเปลี่ยนแปลงด้านบรรณาธิการและการจัดรูปแบบเพื่อปรับปรุงความชัดเจนและความสม่ำเสมอ แนวทางรัฐบัญญัติความปลอดภัยด้านอาหารของ FDA ฉบับนี้ให้ข้อมูลโดยละเอียดเพื่อช่วยให้โรงงานอาหารสัตว์คาดการณ์อันตรายด้านความปลอดภัยของอาหารที่อาจเกิดขึ้น ระบุการควบคุมเชิงป้องกันตามความเสี่ยงเพื่อป้องกันหรือลดอันตรายเหล่านั้น และสร้างและดำเนินการตามแผนเพื่อป้องกันไม่ให้อาหารสัตว์ที่ไม่ปลอดภัยเข้าสู่ตลาด โดยสามารถศึกษาเอกสารเพิ่มเติมได้ที่ httpswww.fda.govmedia110477download ที่มา U.S.FDA สรุปโดย มกอช."
prompt = prompt.event_extraction_prompt_zero_shot(article=example_text)

response = client.models.generate_content(
    model="gemini-2.0-flash",
    contents=prompt,
)

print(response.text)
